Repository: Eden-Mor/Inventory-Management-System
Catalog: IMS/Resources/Components.Pages.Sellers.*.resx
Languages: he

# Title
source: Seller Management
he: ניהול מוכרים

source: Add New Seller
he: הוסף מוכר חדש

# NameLabel
source: Name
he: שם

source: Add Seller
he: הוסף מוכר

source: Name
he: שם

source: Status
he: סטטוס

source: Change Status
he: שנה סטטוס

source: Save
he: שמור

source: Error changing status
he: נכשל בשינוי סטטוס

source: Error adding seller
he: נכשל בהוספת מוכר
